// ***********************************************************
//	watchdog.c
// 	Сторожевой таймер
//  
//  teplofizik, 2015
// ***********************************************************

#include "watchdog.h"
#include "../drivers.h"
#include <stm32f0xx.h>

void wdt_Init(void)
{
    // Останавливать WDT, когда отладчик спит
    DBGMCU->APB1FZ |= DBGMCU_APB1_FZ_DBG_IWDG_STOP;
    
    // Разрешить WDT
    IWDG->KR = 0x0000CCCC;
    // Разрешить доступ к регистрам
    IWDG->KR = 0x00005555;
    // Настройка предделителя /8
    IWDG->PR = 1;
    // Задание верхнего предела счетчика
    IWDG->RLR = 0xFFF;
    
    // Ожидание завершения настройки
    while(IWDG->SR != 0) {}
        
    // Сброс счетчика в начальное значение
    IWDG->KR = 0x0000AAAA;
}

void wdt_Reset(void)
{
    // Сброс счетчика в начальное значение
    IWDG->KR = 0x0000AAAA;
}
